In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({ 'a':[0,0,0], 'b': [1,2,3]})
df2 = df1
df2['a'] = df2['a'] + 1
df1.head()

   a  b
0  1  1
1  1  2
2  1  3

In [3]:
df2 = df1.copy()

In [4]:
from copy import deepcopy
df = deepcopy(df1)

In [5]:
level_map = {1: 'high', 2: 'medium', 3: 'low'}
df['b_level'] = df['b'].map(level_map)

In [6]:
df

   a  b b_level
0  1  1    high
1  1  2  medium
2  1  3     low

In [7]:
def rule(x, y):
    if x == 'high' and y > 10:
         return 1
    else:
         return 0
df = pd.DataFrame({ 'c1':[ 'high' ,'high', 'low', 'low'], 'c2': [0, 23, 17, 4]})
df['new'] = df.apply(lambda x: rule(x['c1'], x['c2']), axis =  1)
df.head()

     c1  c2  new
0  high   0    0
1  high  23    1
2   low  17    0
3   low   4    0

In [8]:
df['maximum'] = df[['c2']].max(axis =1)
df

     c1  c2  new  maximum
0  high   0    0        0
1  high  23    1       23
2   low  17    0       17
3   low   4    0        4

In [9]:
df['c1'].value_counts()

high    2
low     2
Name: c1, dtype: int64

In [10]:
df['c1'].value_counts().sort_index()

high    2
low     2
Name: c1, dtype: int64

In [11]:
df = pd.DataFrame({ 'id': [1,2,3], 'c1':[0,0,np.nan], 'c2': [np.nan,1,1]})
df = df[['id', 'c1', 'c2']]
df['num_nulls'] = df[['c1', 'c2']].isnull().sum(axis=1)
df.head()

   id   c1   c2  num_nulls
0   1  0.0  NaN          1
1   2  0.0  1.0          0
2   3  NaN  1.0          1

In [12]:
df_filter = df['id'].isin([2])
df[df_filter]

   id   c1   c2  num_nulls
1   2  0.0  1.0          0

In [13]:
cut_points = [np.percentile(df['id'], i) for i in [50, 80, 95]]
df['group'] = 1
for i in range(3):
    df['group'] = df['group'] + (df['id'] < cut_points[i])
# or <= cut_points[i]

In [14]:
df

   id   c1   c2  num_nulls  group
0   1  0.0  NaN          1      4
1   2  0.0  1.0          0      3
2   3  NaN  1.0          1      1